import type { NextConfig } from "next";

const nextConfig: NextConfig = {
  // ---------------------------------------------------------
  // خروجی استاتیک برای PWA
  // ---------------------------------------------------------
  output: "export",

  // ---------------------------------------------------------
  // چون خروجی استاتیک داریم، Next Image Optimization
  // باید غیرفعال شود.
  // ---------------------------------------------------------
  images: {
    unoptimized: true,
  },

  // ---------------------------------------------------------
  // حذف نشانگرهای توسعه Next.js
  // ---------------------------------------------------------
  devIndicators: false,

  // ---------------------------------------------------------
  // تنظیمات Webpack
  //
  // برای Docker و Hot Reload از polling استفاده می‌کنیم.
  // ---------------------------------------------------------
  webpack: (config) => {
    config.watchOptions = {
      poll: 1000,
      aggregateTimeout: 300,
    };

    return config;
  },

  // ---------------------------------------------------------
  // Next.js 16 به‌صورت پیش‌فرض Turbopack را فعال می‌کند.
  //
  // چون پروژه ما webpack config دارد، صریحاً یک
  // تنظیم Turbopack خالی قرار می‌دهیم تا Next بداند
  // این پروژه تنظیمات Turbopack اختصاصی ندارد.
  // ---------------------------------------------------------
  turbopack: {},
};

export default nextConfig;