/**
 * ============================================================
 * Customer Repository
 * ============================================================
 *
 * این Repository فقط مسئول ارتباط مستقیم
 * با جدول Customer در دیتابیس است.
 *
 * منطق Business در Service قرار می‌گیرد.
 * ============================================================
 */

import { prisma } from "../../../lib/prisma";

/**
 * ------------------------------------------------------------
 * پیدا کردن مشتری بر اساس ID
 * ------------------------------------------------------------
 */
export const findCustomerById = async (
  id: string
) => {
  return prisma.customer.findUnique({
    where: {
      id,
    },
  });
};