/**
 * ============================================================
 * Customer Repository
 * ============================================================
 *
 * این Repository فقط مسئول ارتباط مستقیم
 * با جدول Customer و اطلاعات مرتبط موردنیاز آن است.
 *
 * منطق Business در Service قرار می‌گیرد.
 * ============================================================
 */

import { prisma } from "../../../lib/prisma";

/**
 * ------------------------------------------------------------
 * پیدا کردن مشتری بر اساس ID
 * ------------------------------------------------------------
 *
 * علاوه بر اطلاعات Customer،
 * اطلاعات User نیز دریافت می‌شود؛
 * چون شماره موبایل در جدول User قرار دارد.
 */
export const findCustomerById = async (
  id: string
) => {
  return prisma.customer.findUnique({
    where: {
      id,
    },

    include: {
      user: true,
    },
  });
};