/**
 * ============================================================
 * Search Route
 * ============================================================
 *
 * این فایل Route مربوط به:
 *
 *     /search
 *
 * است.
 *
 * ============================================================
 *
 * این فایل Business Logic ندارد.
 *
 * وظیفه آن فقط این است:
 *
 *     /search
 *        ↓
 *     features/search/page.tsx
 *
 * ============================================================
 */

import SearchPage from "@/features/search/page";

/**
 * ============================================================
 * Next.js Page
 * ============================================================
 */

export default function Page() {
  return <SearchPage />;
}